artillery-tests/delete-users.yml
#1- ir buscar o user
#2-autenticar com esse user
#3- apagar-se
#
config:
  target: 'https://scc2122appwesteurope54939.azurewebsites.net/rest'
#  target: 'http://localhost:8080/scc2122-backend/rest'
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint: {}
  processor: "./test-utils.js"
  variables:
     metricsProcessEndpoint : "myProcessEndpoint"  # function used to aggregate endpoints for statistics
  phases:
  - name: "Delete users"    # delete users
    duration: 1
    arrivalCount: 1

scenarios:
  - name: 'Delete users'
    weight: 1
    flow:
      - loop:                            # let's create 10 public channels - loop ... count
        - function: "selectUserSkewed"
        - post:                          # First: login as a user
            url: "/users/auth"
            headers:
              Content-Type: application/json
            json:
              id: "{{ user }}"
              pwd: "{{ pwd }}"
#        - function: "genNewChannel"
        - delete:                          # Create channel
            url: "/users/{{ user }}"
            afterResponde: "deleteUserReply"
#            headers:
#              Content-Type: application/json
#              Accept: application/json
#            json:
#              name: "{{ channelName }}"
#              owner: "{{ user }}"
#              publicChannel: true
#              members: ["{{ user }}"]
#            capture:                     # Capturing channel id
#              - json: $.id
#                as: "channelId"
#        - loop:                          # Let's add 20 users to the channel
          # - function: "selectUserSkewed"
          # - post:                         
          #     url: "/users/auth"
          #     headers:
          #       Content-Type: application/json
          #     json:
          #       id: "{{ user }}"
          #       pwd: "{{ pwd }}"
          # - put:                          # Subscribe     
          #     url: "/channels/{{ channelId }}/subscribe/{{ user }}"
          # count: 20
        count: 50
      # - loop:                            # let's create 45 private channels - loop ... count
      #   - function: "selectUserSkewed"
      #   - post:                          # First: login as a user
      #       url: "/users/auth"
      #       headers:
      #         Content-Type: application/json
      #       json:
      #         id: "{{ user }}"
      #         pwd: "{{ pwd }}"
      #   - function: "genNewChannel"
      #   - post:                          # Create channel
      #       url: "/channels"
      #       headers:
      #         Content-Type: application/json
      #         Accept: application/json
      #       json:
      #         name: "{{ channelName }}"
      #         owner: "{{ user }}"
      #         publicChannel: false
      #         members: ["{{ user }}"]
      #       capture:                     # Capturing channel id
      #         - json: $.id
      #           as: "channelId"
      #   - loop:                          # Let's add 10 users to the channel
      #     - function: "selectUserSkewed"
      #     - put:                          # Add user to private channel   
      #         url: "/channels/{{ channelId }}/add/{{ user }}"
      #     count: 10
      #   count: 45